<a href="https://colab.research.google.com/github/sandeep92134/The-Data-Science-Workshop-By-Packt/blob/master/module%2011/Exercise11.03%3A%20Fixing%20Incorrect%20Values%20in%20the%20State%20Column.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
file_url = 'https://raw.githubusercontent.com/sandeep92134/The-Data-Science-Workshop-By-Packt/master/module%2011/datasets/officers.csv'

In [3]:
df = pd.read_csv(file_url)

In [4]:
df.head()

      ID           City State    Zip      Title  RedactionRequested
0    804       Glenview    IL  60025  Treasurer               False
1   9177     Harrisburg    IL  62946  Treasurer               False
2  53011        Chicago    IL  60606  Treasurer               False
3   9176     Harrisburg    IL  62946   Chairman               False
4  33020  Mechanicsburg    IL  62545   Chairman               False

In [5]:
df['State'].unique()

array(['IL', 'PA', 'DC', 'Il', nan, 'WI', 'CA', 'MO', 'NC', 'IA', 'MA',
       'IN', 'MI', 'TN', 'NY', 'ng', 'TX', 'CO', 'NV', 'il', 'WA', '8I',
       'In', 'iL', 'OH', 'SC', 'VA', 'NM', 'FL', 'LA', 'GA', 'II', 'NJ',
       'MD', 'I', 'AR', 'KS', 'DE', '60', 'SD', 'MN', 'VT', 'OK', 'KY',
       'CT', 'NH', 'AZ', 'OR', 'PR', 'RI'], dtype=object)

In [6]:
df[df['State'].str.contains('il', na=False)]

          ID       City State         Zip       Title  RedactionRequested
4245   47448    Chicago    il       60619   Treasurer               False
4651   47447    Chicago    il  60623-1614    Chairman               False
4652   54025    Chicago    il  60623-1614    Chairman               False
18939  39418   Kingston    il       60145    Chairman               False
29699  27124  Hampshire    il       60140    Chairman               False
43761  29179    McHenry    il       60050  Admin Asst               False

In [7]:
for state in ['Il', 'iL', 'Il']:
  print(df.loc[df['State'] == state, ['City', 'State']])

            City State
43        Ottawa    Il
44        Ottawa    Il
493    Galesburg    Il
613      Chicago    Il
614      Chicago    Il
...          ...   ...
54915    Chicago    Il
54916    Chicago    Il
54918    Chicago    Il
54919    Chicago    Il
54921    Chicago    Il

[665 rows x 2 columns]
         City State
7052  Wheaton    iL
            City State
43        Ottawa    Il
44        Ottawa    Il
493    Galesburg    Il
613      Chicago    Il
614      Chicago    Il
...          ...   ...
54915    Chicago    Il
54916    Chicago    Il
54918    Chicago    Il
54919    Chicago    Il
54921    Chicago    Il

[665 rows x 2 columns]

In [8]:
il_mask = df['State'].isin(['il', 'Il', 'iL', 'Il'])

In [9]:
il_mask.sum()

672

In [10]:
df.loc[il_mask, 'State'] = 'IL'

In [11]:
df['State'].unique()

array(['IL', 'PA', 'DC', nan, 'WI', 'CA', 'MO', 'NC', 'IA', 'MA', 'IN',
       'MI', 'TN', 'NY', 'ng', 'TX', 'CO', 'NV', 'WA', '8I', 'In', 'OH',
       'SC', 'VA', 'NM', 'FL', 'LA', 'GA', 'II', 'NJ', 'MD', 'I', 'AR',
       'KS', 'DE', '60', 'SD', 'MN', 'VT', 'OK', 'KY', 'CT', 'NH', 'AZ',
       'OR', 'PR', 'RI'], dtype=object)

In [12]:
df.loc[df['State'] == 'II',]

          ID         City State    Zip        Title  RedactionRequested
14340  28039  Bloomington    II  61704  Co-Chairman               False
14341  31994  Bloomington    II  61704     Chairman               False

In [13]:
for val in ['I', '8I', '60']:
  print(df.loc[df['State'] == val, ['City', 'State']])

              City State
17596  Bloomington     I
             City State
5513  Springfield    8I
          City State
28060  Chicago    60

In [14]:
for val in ['II', 'I', '8I', '60']:
  df.loc[df['State'] == val, 'State'] = 'IL'

In [15]:
df['State'].unique()

array(['IL', 'PA', 'DC', nan, 'WI', 'CA', 'MO', 'NC', 'IA', 'MA', 'IN',
       'MI', 'TN', 'NY', 'ng', 'TX', 'CO', 'NV', 'WA', 'In', 'OH', 'SC',
       'VA', 'NM', 'FL', 'LA', 'GA', 'NJ', 'MD', 'AR', 'KS', 'DE', 'SD',
       'MN', 'VT', 'OK', 'KY', 'CT', 'NH', 'AZ', 'OR', 'PR', 'RI'],
      dtype=object)

In [16]:
for val in ['In', 'ng']:
  print(df.loc[df['State'] == val, ['City', 'State']])

           City State
5733  Sherville    In
            City State
2428  none given    ng
2961  none given    ng

In [17]:
df.loc[df['State'].str.contains('In', na=False), 'State'] = 'IN'

In [18]:
df['State'].unique()

array(['IL', 'PA', 'DC', nan, 'WI', 'CA', 'MO', 'NC', 'IA', 'MA', 'IN',
       'MI', 'TN', 'NY', 'ng', 'TX', 'CO', 'NV', 'WA', 'OH', 'SC', 'VA',
       'NM', 'FL', 'LA', 'GA', 'NJ', 'MD', 'AR', 'KS', 'DE', 'SD', 'MN',
       'VT', 'OK', 'KY', 'CT', 'NH', 'AZ', 'OR', 'PR', 'RI'], dtype=object)